app/controllers/photos_controller.rb

  def index
    @desc = true
    @desc = false if params[:desc] == 'true'
    @photos = @album.photos.order_by(params[:order_by], params[:desc])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."album_id" = $1  ORDER BY "photos"."id" ASC LIMIT 1  [["album_id", 1]]

  def create
    @photo = @album.photos.build(photo_params)
    if @photo.save
---
INSERT INTO "photos" ("image", "description", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", "287.jpg"], ["description", "Awwww"], ["album_id", 1], ["created_at", "2015-06-03 04:30:54.528268"], ["updated_at", "2015-06-03 04:30:54.528268"]]

  def update
    if @photo.update(photo_params)
---
UPDATE "photos" SET "image" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["image", nil], ["updated_at", "2015-06-03 04:20:40.355614"], ["id", 1]]

    def set_album
      @album = Album.find(params[:album_id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", 1]]